#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Berkeley
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC
#+BIND: org-latex-image-default-width 0.7\linewidth
#+BIND: org-latex-image-default-height 0.7\linewidth
#+PROPERTY: header-args:R :session *R*  :eval no-export :height 360 :width 360
#+OPTIONS: tasks:nil
#+OPTIONS: toc:nil
#+AUTHOR: Richie Morrisroe
#+TITLE: Visualisation: Modelling the World

* Simple Statistical Graphics
- Graphs excel at showing relations between things
- Consider the difference between quantiles of a variable, and a density plot
- For example, the price of houses:
#+begin_src R :session :colnames no :rownames yes :exports results
with(ppr_gc, quantile(price, seq(0, 1, .1))) %>% as.data.frame() 
#+end_src

#+RESULTS:
|   0% |      5079 |
|  10% |     55000 |
|  20% |     85000 |
|  30% |    115000 |
|  40% |    145000 |
|  50% |    175000 |
|  60% |    214000 |
|  70% |    255505 |
|  80% |    315000 |
|  90% |    430000 |
| 100% | 139165000 |
* Iterating over data and visuals :noexport:
y#+begin_src R :session :colnames yes :eval no
# this is an S4 object with geographical data 
shp <- readOGR("~/Dropbox/PPR/electoral_divisions_gps.shp") 
#the data slot contains a dataframe - countyname is the LEO's
with(shp@data, table(COUNTYNAME)) %>% as.data.frame() %>% arrange(desc(Freq)) %>% head(10)
#+end_src

#+RESULTS:
| COUNTYNAME      | Freq |
|-----------------+------|
| Cork County     |  324 |
| Galway County   |  214 |
| Kerry County    |  164 |
| Dublin City     |  162 |
| Mayo County     |  152 |
| Clare County    |  151 |
| Donegal County  |  149 |
| Limerick County |  135 |
| Wexford County  |  124 |
| Kilkenny County |  113 |
- These are the local electoral authorities
- These are from the geocoded points, so they should be somewhat better
- the PPR data is sometimes crazy wrong [fn:5]


#+begin_src R :session :results none :exports code
#NUTS3
county_region_map <- shp@data[,"COUNTYNAME", "NUTS3NAME"]
ppr_gc_county_fix <- ppr_gc2 %>%
  mutate(COUNTYNAME=ifelse(length(geo_county)==1, paste(geo_county, "County", sep=" "), geo_county))
  
#+end_src
